# SQL DML Auditory Exercise - First Part

Welcome to the auditory exercise on Data Manipulation Language (DML)! In this session, we will focus on essential SQL operations to retrieve and manipulate data effectively. DML is a core component of SQL that empowers you to interact with the data stored in your database tables. Mastering DML expressions is a key skill for any database professional or data analyst.

## What You Will Learn

By the end of this exercise, you will have a thorough understanding of:

### Retrieving Data from a Database Table
- Learn how to use the `SELECT` statement to retrieve specific columns or rows of data.
- Understand the use of `WHERE` clauses to filter data based on specified conditions.

### Exploring the `INNER JOIN` Operation
- Discover how to combine data from multiple tables using `INNER JOIN`.
- Understand the concept of table relationships and how joins work to retrieve meaningful insights.

### Working with Basic Aggregation Functions
- Learn how to use aggregate functions such as:
  - `COUNT()`: Count the number of rows in a result set.
  - `MAX()`: Find the maximum value in a column.
  - `AVG()`: Calculate the average value of a numeric column.
  - And others like `SUM()` and `MIN()`.
- Understand how to group data using `GROUP BY` and filter groups using `HAVING`.

## What You Will Be Capable Of

After completing this exercise, you will be able to:

- Write SQL queries to retrieve and filter data effectively.
- Combine data from multiple tables using `INNER JOIN` to gain deeper insights.
- Apply aggregate functions to analyze and summarize data in a meaningful way.
- Use `GROUP BY` and `HAVING` to organize and filter grouped data.

This exercise is designed to enhance your ability to query and analyze data from relational databases confidently. Whether you're preparing for academic projects or professional tasks, these skills will prove invaluable. 

Let’s dive into the world of SQL DML and start exploring data like a pro!

# Problem 1

# Writing SQL Queries Based on an ER Diagram

Based on the provided ER diagram and the relationships derived from it, your task is to write SQL queries to satisfy the given requirements.

![manufacturers_and_parts](.\manufacturers_and_parts.png)

The queries should leverage the structure and attributes of the following relations:

### Relations

1. **Deliverer**: (<u>`Id`</u>, `Name`, `Status`, `City`)
2. **Part**: (<u>`Id`</u>, `Name`, `Color`, `Weight`)
3. **Manufacturer**: (<u>`Id`</u>, `Name`, `City`)
4. **Offers**: (<u>`DelivererId*`</u>, <u>`PartId*`</u>, <u>`ManufacturerId*`</u>, `Quantity`, `Price`)

Each query should be written to retrieve or manipulate data according to the specific requirements outlined below. Ensure that your SQL statements use appropriate joins, filters, and aggregations where necessary.

* * *

## Requirements and SQL Queries

### **SQL Query 1**: Retrieve all data for manufacturers located in Skopje and Bitola.

- **Requirement**: Write an SQL query to extract all attributes of manufacturers whose city is either Skopje or Bitola.
- **Hint**: Use the `MANUFACTURER` table and filter rows based on the `City` attribute.

* * *

### **SQL Query 2**: Get the IDs of deliverers who have submitted an offer for part no. 5 from manufacturer no. 1.

- **Requirement**: Write an SQL query to retrieve the `DelivererId` of deliverers with an offer for part `Id = 5` and manufacturer `Id = 1`.
- **Hint**: Use the `OFFERS` table with appropriate conditions on `PartId` and `ManufacturerId`.

* * *

### **SQL Query 3**: List the unique colors of parts offered by deliverer no. 8.

- **Requirement**: Retrieve the distinct `Color` of parts that have been bid on by the deliverer with `Id = 8`.
- **Hint**: Use a join between the `OFFERS` and `PARTS` tables to access the `Color` attribute.

* * *

### **SQL Query 4**: List the IDs of the parts delivered for products manufactured in Bitola.

- **Requirement**: Write a query that lists the IDs delivered for products manufactured in Bitola.
- **Hint**: Join the `OFFERS` table with the `MANUFACTURER` table, and filter by `City = 'Bitola'`.

* * *

### **SQL Query 5**: List the IDs of the parts for which there is an offer, where the deliverer and manufacturer are from the same city.

- **Requirement**: List the IDs of the parts (`PartId`) where there is an offer and the deliverer and manufacturer involved are located in the same city.
- **Hint**: Use a join between the `DELIVERER`, `MANUFACTURER`, and `OFFERS` tables, with a condition to check that their `City` attributes match.

* * *

This exercise will help you strengthen your understanding of SQL query writing by applying concepts like filtering, joining tables, and using aggregate functions. By completing these queries, you will gain practical skills to retrieve meaningful data from a relational database.

# Understanding the SELECT Query in SQL

The `SELECT` statement is one of the most fundamental and widely used commands in SQL. It allows you to retrieve data from one or more tables in a database based on specific criteria. Below, we explore the `SELECT` query in detail, including its syntax and all possible options.

## Basic Syntax

```sql
SELECT column1, column2, ...
FROM table_name
WHERE condition
GROUP BY column_name
HAVING condition
ORDER BY column_name [ASC | DESC]
LIMIT number_of_rows;
```

## Detailed Explanation of Each Clause

### 1. SELECT Clause

This specifies the columns you want to retrieve from the table.

**Example:**

```sql
SELECT Name, Age FROM Students;
```

This retrieves the `Name` and `Age` columns from the `Students` table.

**Options**

Use `*` to select all columns

```sql
SELECT * FROM Students;
```

Use functions like `COUNT`, `AVG`, `MAX`, `MIN`, and `SUM` for aggregate results:

```sql
SELECT COUNT(*) FROM Students;
```

### 2. FROM Clause

Specifies the table(s) from which to retrieve data.

**Example**

```sql
SELECT * FROM Orders;
```

Retrieves all data from the `Orders` table.

**Joins**: Combine multiple tables to fetch related data.

```sql
SELECT Orders.OrderID, Customers.CustomerName
FROM Orders
INNER JOIN Customers ON Orders.CustomerID = Customers.CustomerID;
```

### 3. WHERE Clause

Filters rows based on a condition.

**Example**

```sql
SELECT * FROM Employees WHERE Age > 30;
```

Retrieves employees older than 30.

**Operators**

### Comparison Operators
- `=`: Equal to
- `!=`: Not equal to
- `>`: Greater than
- `<`: Less than
- `>=`: Greater than or equal to
- `<=`: Less than or equal to

```sql
SELECT * FROM Employees WHERE Name LIKE 'A%';

```

### 4. GROUP BY Clause

Groups rows sharing a common attribute, often used with aggregate functions.

**Example**

```sql
SELECT Department, AVG(Salary) 
FROM Employees 
GROUP BY Department;
```

Calculates the average salary for each department.


### 5. HAVING Clause

Filters grouped data. It is used after GROUP BY.

**Example**

```sql

SELECT Department, COUNT(*)
FROM Employees
GROUP BY Department
HAVING COUNT(*) > 5;
```

Shows only departments with more than 5 employees.


### 6. ORDER BY Clause

Sorts the results by one or more columns.

**Example**

```sql

SELECT * FROM Students ORDER BY Name ASC;
```

Retrieves students sorted alphabetically by name.

**Options:**

- `ASC` (ascending order - default)
- `DESC` (descending order)

### 7. LIMIT Clause

Restricts the number of rows returned by the query.

**Example**

```sql

SELECT * FROM Products LIMIT 10;

```

**Alternative in SQL Server: Use TOP**

```sql
SELECT TOP 10 * FROM Products;

```

### 8. DISTINCT Keyword

Eliminates duplicate rows in the result set.

**Example**

```sql
SELECT DISTINCT City FROM Customers;

```

Retrieves unique cities from the `Customers` table.

### 9. Aliases

Assign temporary names to columns or tables for better readability.

**Example**

```sql
SELECT Name AS FullName, Age AS Years FROM Students;

```

In [1]:
/*
    This script checks if a database named 'db_dml_first_problem' exists:
    - If the database does NOT exist, it creates a new empty database.
    - If the database DOES exist, it deletes all tables within the database by:
        1. Dropping all foreign key constraints to handle dependencies.
        2. Dropping all tables to make the database empty.
*/

-- Check if the database exists
IF (SELECT COUNT(*) FROM sys.databases WHERE name = 'db_dml_first_problem') = 0
BEGIN
    -- Create the database if it doesn't exist
    CREATE DATABASE db_dml_first_problem;
    PRINT 'Database created: db_dml_first_problem';
END
ELSE
BEGIN
    PRINT 'Database already exists: db_dml_first_problem';
END

GO
-- Use the database
USE db_dml_first_problem;

-- Step 1: Drop all foreign key constraints if any exist
IF EXISTS (SELECT * FROM sys.foreign_keys)
BEGIN
    DECLARE @sql NVARCHAR(MAX);
    SET @sql = '';

    SELECT @sql = @sql + 'ALTER TABLE [' + OBJECT_NAME(parent_object_id) 
                 + '] DROP CONSTRAINT [' + name + '];' + CHAR(13)
    FROM sys.foreign_keys;

    EXEC sp_executesql @sql;
    PRINT 'Foreign keys dropped';
END
ELSE
BEGIN
    PRINT 'No foreign keys to drop';
END

-- Step 2: Drop all tables if any exist
IF EXISTS (SELECT * FROM sys.tables)
BEGIN
    SET @sql = '';

    SELECT @sql = @sql + 'DROP TABLE [' + name + '];' + CHAR(13)
    FROM sys.tables;

    EXEC sp_executesql @sql;
    PRINT 'Tables dropped';
END
ELSE
BEGIN
    PRINT 'No tables to drop';
END

In [2]:
USE db_dml_first_problem;

# Creating and Populating Tables

The following cell in this notebook contains the DDL expressions required to create the necessary tables based on the provided ER diagram and relations. Additionally, it includes `INSERT` statements to populate these tables with sample data. 

By executing the DDL and DML statements, you will have a fully prepared database schema and data, enabling you to write and execute SQL queries to solve the tasks outlined in the exercise.

## What You Will Gain
- A set of tables (`DELIVERER`, `PARTS`, `MANUFACTURERS`, and `OFFERS`) accurately representing the structure and relationships from the ER diagram.
- Populated tables with sample data to test and validate your SQL queries.

Ensure you execute the cell to set up the environment before proceeding with the SQL tasks.

In [3]:
-- Creating the Deliverer table
-- This table stores details about deliverers, including their ID, name, status, and city.
CREATE TABLE dbo.Deliverer (
    Id INT PRIMARY KEY,
    Name VARCHAR(40),
    Status VARCHAR(10) CHECK (Status IN ('Active', 'Inactive')),
    City VARCHAR(20)
);

GO

-- Inserting bulk data into Deliverer table
INSERT INTO dbo.Deliverer (Id, Name, Status, City)
VALUES 
(1, 'Deliverer A', 'Active', 'Skopje'),
(2, 'Deliverer B', 'Inactive', 'Bitola'),
(3, 'Deliverer C', 'Active', 'Ohrid'),
(4, 'Deliverer D', 'Inactive', 'Prilep'),
(5, 'Deliverer E', 'Active', 'Tetovo'),
(6, 'Deliverer F', 'Inactive', 'Veles'),
(7, 'Deliverer G', 'Active', 'Strumica'),
(8, 'Deliverer H', 'Inactive', 'Kumanovo'),
(9, 'Deliverer I', 'Active', 'Gostivar'),
(10, 'Deliverer J', 'Inactive', 'Struga');

GO

-- Creating the Part table
-- This table stores details about parts, including their ID, name, color, and weight.
CREATE TABLE dbo.Part (
    Id INT PRIMARY KEY,
    Name VARCHAR(50),
    Color VARCHAR(10),
    [Weight] FLOAT
);

GO

-- Inserting bulk data into Part table
INSERT INTO dbo.Part (Id, Name, Color, Weight)
VALUES 
(1, 'Part A', 'Red', 2.5),
(2, 'Part B', 'Blue', 3.0),
(3, 'Part C', 'Green', 4.5),
(4, 'Part D', 'Yellow', 5.0),
(5, 'Part E', 'Black', 2.3),
(6, 'Part F', 'White', 3.8),
(7, 'Part G', 'Purple', 1.2),
(8, 'Part H', 'Orange', 6.0),
(9, 'Part I', 'Pink', 2.8),
(10, 'Part J', 'Grey', 3.1);

GO

-- Creating the Manufacturer table
-- This table stores details about manufacturers, including their ID, name, and city.
CREATE TABLE dbo.Manufacturer (
    Id INT PRIMARY KEY,
    Name VARCHAR(50),
    City VARCHAR(20)
);

GO

-- Inserting bulk data into Manufacturer table
INSERT INTO dbo.Manufacturer (Id, Name, City)
VALUES 
(1, 'Manufacturer A', 'Skopje'),
(2, 'Manufacturer B', 'Bitola'),
(3, 'Manufacturer C', 'Ohrid'),
(4, 'Manufacturer D', 'Prilep'),
(5, 'Manufacturer E', 'Tetovo'),
(6, 'Manufacturer F', 'Veles'),
(7, 'Manufacturer G', 'Strumica'),
(8, 'Manufacturer H', 'Kumanovo'),
(9, 'Manufacturer I', 'Gostivar'),
(10, 'Manufacturer J', 'Struga');

GO

-- Creating the Offers table
-- This table stores details about offers, including DelivererId, PartId, ManufacturerId, quantity, and price.
CREATE TABLE dbo.Offers (
    DelivererId INT,
    PartId INT,
    ManufacturerId INT,
    Quantity INT,
    Price FLOAT,
    PRIMARY KEY (DelivererId, PartId, ManufacturerId),
    FOREIGN KEY (DelivererId) REFERENCES dbo.Deliverer(Id),
    FOREIGN KEY (PartId) REFERENCES dbo.Part(Id),
    FOREIGN KEY (ManufacturerId) REFERENCES dbo.Manufacturer(Id)
);

GO

-- Inserting bulk data into Offers table
INSERT INTO dbo.Offers (DelivererId, PartId, ManufacturerId, Quantity, Price)
VALUES 
(1, 1, 1, 50, 10.00),
(2, 1, 2, 30, 15.00),
(3, 2, 1, 60, 12.00),
(4, 2, 3, 40, 20.00),
(5, 3, 2, 30, 18.00),
(6, 3, 4, 70, 15.00),
(7, 4, 3, 50, 22.00),
(8, 3, 1, 80, 17.00),
(8, 4, 5, 80, 17.00),
(8, 5, 4, 80, 17.00),
(9, 5, 4, 65, 14.00),
(10, 5, 6, 55, 19.00);

GO

### **SQL Query 1**: Retrieve all data for manufacturers located in Skopje and Bitola.

- **Requirement**: Write an SQL query to extract all attributes of manufacturers whose city is either Skopje or Bitola.
- **Hint**: Use the `MANUFACTURER` table and filter rows based on the `City` attribute.

In [4]:
-- Query Explanation:
-- This query retrieves all columns (*) from the 'Manufacturer' table in the 'dbo' schema 
-- where the 'City' column contains values that match either 'Skopje' or 'Bitola'. 
-- 
-- Key Points:
-- 1. SELECT *: This selects all columns from the Manufacturer table. While it is concise, 
--    it is often better to explicitly specify the required columns for better performance and clarity.
-- 2. FROM dbo.Manufacturer: Specifies the table being queried, which is 'Manufacturer' under the 'dbo' schema.
-- 3. WHERE City IN ('Skopje', 'Bitola'): 
--    - The WHERE clause filters the rows, ensuring only records where the 'City' value matches 
--      'Skopje' or 'Bitola' are included in the result.
--    - The IN operator is a shorthand for multiple OR conditions. For example:
--      WHERE City = 'Skopje' OR City = 'Bitola'
--      Using IN enhances readability and is more compact.
-- 
-- Purpose:
-- This query is useful for scenarios where you want to analyze or process manufacturers located 
-- in specific cities ('Skopje' and 'Bitola').

SELECT * 
FROM dbo.Manufacturer
WHERE City IN ('Skopje', 'Bitola');

Id,Name,City
1,Manufacturer A,Skopje
2,Manufacturer B,Bitola

### **SQL Query 2**: Get the IDs of deliverers who have submitted an offer for part no. 5 from manufacturer no. 1.

- **Requirement**: Write an SQL query to retrieve the `DelivererId` of deliverers with an offer for part `Id = 5` and manufacturer `Id = 1`.
- **Hint**: Use the `OFFERS` table with appropriate conditions on `PartId` and `ManufacturerId`.

In [8]:
-- Query Explanation:
-- This query retrieves the `DelivererId` from the `Offers` table in the `dbo` schema 
-- where the following conditions are met:
-- 
-- 1. The `PartId` is equal to 5.
--    - This filters the rows to include only offers that are associated with the part 
--      having an ID of 5.
-- 
-- 2. The `ManufacturerId` is equal to 4.
--    - This further narrows down the results to include only offers that correspond 
--      to the manufacturer with an ID of 4.
-- 
-- Key Points:
-- - SELECT DelivererId:
--   - This ensures that only the `DelivererId` column is returned in the query results.
--   - It identifies which deliverers have made offers for the specified part and manufacturer.
-- 
-- - WHERE PartId = 5 AND ManufacturerId = 4:
--   - Combines the conditions using the AND operator, ensuring both criteria must be met 
--     for a row to be included in the result set.
-- 
-- Purpose:
-- This query is useful for finding deliverers who have submitted offers for a specific 
-- part (PartId = 5) from a specific manufacturer (ManufacturerId = 4). This can help 
-- in tracking deliverer participation for targeted products and manufacturers.

SELECT DelivererId
FROM dbo.Offers
WHERE PartId = 5 AND ManufacturerId = 4;

DelivererId
8
9

### **SQL Query 3**: List the unique colors of parts offered by deliverer no. 8.

- **Requirement**: Retrieve the distinct `Color` of parts that have been bid on by the deliverer with `Id = 8`.
- **Hint**: Use a join between the `OFFERS` and `PARTS` tables to access the `Color` attribute.

In [11]:
/*
This SQL query retrieves the `Color` of parts that are offered by a deliverer with `DelivererId = 8`.

1. The `FROM dbo.Part p` clause specifies the `dbo.Part` table as the main table, and it is aliased as `p` for easier reference.
2. The `INNER JOIN dbo.Offers o ON p.Id = o.PartId` part joins the `dbo.Part` table with the `dbo.Offers` table on the `Id` field from the `Part` table and the `PartId` field from the `Offers` table. This means we are matching the records where a part exists in an offer.
3. The `WHERE o.DelivererId = 8` clause filters the results to include only those rows where the `DelivererId` in the `Offers` table is equal to `8`. This limits the query to parts offered by the specific deliverer with ID 8.
4. The `SELECT Color` part specifies that the query will return the `Color` column from the `Part` table, which holds the color information for each part.

In summary, the query returns the list of colors of parts that are being offered by deliverer with `DelivererId = 8`.
*/

SELECT DISTINCT p.Color
FROM Offers AS o
INNER JOIN Part as p ON o.PartId = p.Id
WHERE o.DelivererId = 8;

Color
Green
Yellow
Black

### **SQL Query 4**: List the IDs of the parts delivered for products manufactured in Bitola.

- **Requirement**: Write a query that lists the IDs delivered for products manufactured in Bitola.
- **Hint**: Join the `OFFERS` table with the `MANUFACTURER` table, and filter by `City = 'Bitola'`.

In [12]:
/*
This SQL query retrieves the `PartId` of the parts that are offered by manufacturers located in the city of 'Bitola'.

1. The `FROM dbo.Manufacturer m` clause specifies the `dbo.Manufacturer` table as the main table, and it is aliased as `m` for easier reference.

2. The `INNER JOIN dbo.Offers o ON m.Id = o.ManufacturerId` clause performs an inner join between the `dbo.Manufacturer` table and the `dbo.Offers` table. The join condition is `m.Id = o.ManufacturerId`, meaning that the query will match records from both tables where the `Id` of a manufacturer in the `Manufacturer` table corresponds to the `ManufacturerId` in the `Offers` table.

3. The `WHERE m.City = 'Bitola'` clause filters the results to include only those rows where the `City` column in the `Manufacturer` table is equal to 'Bitola'. This means the query will only consider offers made by manufacturers located in 'Bitola'.

4. The `SELECT o.PartId` part specifies that the query will return the `PartId` column from the `Offers` table. This column contains the IDs of the parts that are offered by the manufacturers.

In summary, the query returns the list of `PartId` values for parts offered by manufacturers based in 'Bitola'.
*/

SELECT o.PartId
FROM Offers AS o
JOIN Manufacturer AS m ON o.ManufacturerId = m.Id
WHERE m.City = 'Bitola';

PartId
1
3

In [ ]:
-- Solution with nested query - NOT A GOOD PRACTICE

SELECT PartId
FROM Offers
WHERE ManufacturerId in (SELECT Id
FROM Manufacturer
WHERE City = 'Bitola');

### **SQL Query 5**: List the IDs of the parts for which there is an offer, where the deliverer and manufacturer are from the same city.

- **Requirement**: List the IDs of the parts (`PartId`) where there is an offer and the deliverer and manufacturer involved are located in the same city.
- **Hint**: Use a join between the `DELIVERER`, `MANUFACTURER`, and `OFFERS` tables, with a condition to check that their `City` attributes match.

In [14]:
/*
This SQL query retrieves the `PartId` of the parts offered by manufacturers and deliverers that are located in the same city.

1. The `FROM dbo.Offers o` clause specifies the `dbo.Offers` table as the main table, and it is aliased as `o` for easier reference.

2. The `INNER JOIN dbo.Manufacturer m ON o.ManufacturerId = m.Id` clause performs an inner join between the `dbo.Offers` table and the `dbo.Manufacturer` table. The join condition is `o.ManufacturerId = m.Id`, meaning that the query will match records from both tables where the `ManufacturerId` in the `Offers` table corresponds to the `Id` in the `Manufacturer` table.

3. The `INNER JOIN dbo.Deliverer d ON o.PartId = d.Id` clause performs another inner join between the `dbo.Offers` table and the `dbo.Deliverer` table. The join condition is `o.PartId = d.Id`, meaning that the query will match records from the `Offers` table where the `PartId` corresponds to the `Id` in the `Deliverer` table.

4. The `WHERE m.City = d.City` clause filters the results to include only those rows where the `City` column in the `Manufacturer` table is the same as the `City` column in the `Deliverer` table. This ensures that only those parts are selected where the manufacturer and deliverer are located in the same city.

5. The `SELECT o.PartId` part specifies that the query will return the `PartId` column from the `Offers` table, which contains the IDs of the parts being offered.

In summary, the query returns the list of `PartId` values for parts offered by manufacturers and deliverers who are located in the same city.
*/

SELECT DISTINCT o.PartId
FROM dbo.Offers o 
    INNER JOIN dbo.Manufacturer m ON o.ManufacturerId = m.Id
    INNER JOIN dbo.Deliverer d ON o.PartId = d.Id
WHERE m.City = d.City;

PartId
1

# Problem 2

# Writing SQL Queries Based on an ER Diagram

Based on the provided ER diagram and the relationships derived from it, your task is to write SQL queries to satisfy the given requirements.

![employee_sectors](.\employee_sectors.png)

The queries should leverage the structure and attributes of the following relations:

### Relations

1. **Sector** (<u>`Id`</u>, `Name`, `City`)
2. **Employee** (<u>`Id`</u>, `Name`, `Education`, `Salary`, <u>`SectorId`</u>)
3. **Project** (<u>`Id`</u>, Name, Balance)
4. **WorksOn** (<u>`EmployeeId`</u>, <u>`ProjectId`</u>, Role)

Each query should be written to retrieve or manipulate data according to the specific requirements outlined below. Ensure that your SQL statements use appropriate joins, filters, and aggregations where necessary.

## Requirements and SQL Queries

### **SQL Query 1**: Retrieve the names of departments and employees who are PhD and have a salary greater than 10,000, sorted by employee name.

- **Requirement**: Write an SQL query to get the names of departments and employees who are PhD and have a salary greater than 10,000, ordered by employee name.
- **Hint**: Use the `EMPLOYEES` table to filter for PhD employees with salary \> 10,000, and join with the `SECTORS` table to get department names.

* * *

### **SQL Query 2**: Get the names of employees who are employed in Skopje.

- **Requirement**: Write an SQL query to get the names of employees who work in Skopje.
- **Hint**: Use the `EMPLOYEES` table and join with the `SECTORS` table to filter employees based on their sector's city.

* * *

### **SQL Query 3**: Retrieve an overview of employee qualifications (education) for all departments (Sector) ordered by the sector's name.

- **Requirement**: Write an SQL query that provides an overview of employee qualifications grouped by department.

* * *

### **SQL Query 4**: Get the names of employees who work in department 4 or 7.

- **Requirement**: Write an SQL query to retrieve the names of employees who work in department 4 or 7.
- **Hint**: Filter the `EMPLOYEES` table by `SectorId` for values 4 or 7, and select employee names.

* * *

### **SQL Query 5**: Find the IDs of the departments that do not have workers.

- **Requirement**: Write an SQL query that selects the ID of departments (SECTORS) that do not have any employees.

* * *

### **SQL Query 6**: Select the IDs of Bachelors employees who participate in some projects (work on at least one project).

- **Requirement**: Write an SQL query to get the IDs of Bachelors employees working on projects.
- **Hint**: Use the `WORKS_ON` table to find employees working on projects and filter for bachelor employees from the `EMPLOYEES` table.

* * *

### **SQL Query 7**: Calculate the average personal income of master workers.

- **Requirement**: Write an SQL query to calculate the average salary of Masters employees.
- **Hint**: Use the `EMPLOYEES` table to filter for Masters employees, then calculate the average of their salary.

* * *

### **SQL Query 8**: Count the number of different roles performed in projects by the employee no. 107.

- **Requirement**: Write an SQL query to find the number of distinct roles (functions) employee no. 107 performs in projects.
- **Hint**: Use the `WORKS_ON` table to filter by `EmployeeId = 107` and count distinct `Role` values.

In [15]:
/*
    This script checks if a database named 'db_dml_first_problem' exists:
    - If the database does NOT exist, it creates a new empty database.
    - If the database DOES exist, it deletes all tables within the database by:
        1. Dropping all foreign key constraints to handle dependencies.
        2. Dropping all tables to make the database empty.
*/

-- Check if the database exists
IF (SELECT COUNT(*) FROM sys.databases WHERE name = 'db_dml_second_problem') = 0
BEGIN
    -- Create the database if it doesn't exist
    CREATE DATABASE db_dml_second_problem;
    PRINT 'Database created: db_dml_second_problem';
END
ELSE
BEGIN
    PRINT 'Database already exists: db_dml_second_problem';
END

GO
-- Use the database
USE db_dml_second_problem;

-- Step 1: Drop all foreign key constraints if any exist
IF EXISTS (SELECT * FROM sys.foreign_keys)
BEGIN
    DECLARE @sql NVARCHAR(MAX);
    SET @sql = '';

    SELECT @sql = @sql + 'ALTER TABLE [' + OBJECT_NAME(parent_object_id) 
                 + '] DROP CONSTRAINT [' + name + '];' + CHAR(13)
    FROM sys.foreign_keys;

    EXEC sp_executesql @sql;
    PRINT 'Foreign keys dropped';
END
ELSE
BEGIN
    PRINT 'No foreign keys to drop';
END

-- Step 2: Drop all tables if any exist
IF EXISTS (SELECT * FROM sys.tables)
BEGIN
    SET @sql = '';

    SELECT @sql = @sql + 'DROP TABLE [' + name + '];' + CHAR(13)
    FROM sys.tables;

    EXEC sp_executesql @sql;
    PRINT 'Tables dropped';
END
ELSE
BEGIN
    PRINT 'No tables to drop';
END

In [16]:
USE db_dml_second_problem;

# Creating and Populating Tables

The following cell in this notebook contains the DDL expressions required to create the necessary tables based on the provided ER diagram and relations. Additionally, it includes `INSERT` statements to populate these tables with sample data. 

By executing the DDL and DML statements, you will have a fully prepared database schema and data, enabling you to write and execute SQL queries to solve the tasks outlined in the exercise.

## What You Will Gain
- A set of tables (`DELIVERER`, `PARTS`, `MANUFACTURERS`, and `OFFERS`) accurately representing the structure and relationships from the ER diagram.
- Populated tables with sample data to test and validate your SQL queries.

Ensure you execute the cell to set up the environment before proceeding with the SQL tasks.

In [17]:
-- Creating the Sectors table
-- This table stores information about different sectors. It has three columns:
-- 'Id' as the primary key, which is an integer representing the unique sector ID.
-- 'Name' is a VARCHAR(50) column that stores the sector's name.
-- 'City' is a VARCHAR(15) column that stores the city where the sector is located.
CREATE TABLE dbo.Sector (
    Id INT PRIMARY KEY,
    Name VARCHAR(50),
    City VARCHAR(15)
);

-- Bulk inserting data into the Sectors table
-- These insertions add information about different sectors and their locations.
-- Each sector is identified by a unique 'Id' and has an associated name and city.
INSERT INTO dbo.Sector (Id, Name, City) VALUES
(1, 'Sector A', 'Skopje'),
(2, 'Sector B', 'Bitola'),
(3, 'Sector C', 'Ohrid'),
(4, 'Sector D', 'Prilep'),
(5, 'Sector E', 'Tetovo'),
(6, 'Sector F', 'Veles'),
(7, 'Sector G', 'Strumica'),
(8, 'Sector H', 'Kumanovo'),
(9, 'Sector I', 'Gostivar'),
(10, 'Sector J', 'Struga');

-- Creating the Employees table
-- This table stores information about employees. It has five columns:
-- 'Id' as the primary key, which is an integer representing the unique employee ID.
-- 'Name' is a VARCHAR(50) column that stores the name of the employee.
-- 'Education' is a VARCHAR(15) column representing the educational qualification of the employee.
-- 'Salary' is a FLOAT column that stores the employee's salary.
-- 'SectorId' is a foreign key referencing the 'Id' in the Sectors table to associate each employee with a sector.
CREATE TABLE dbo.Employee (
    Id INT PRIMARY KEY,
    Name VARCHAR(50),
    Education VARCHAR(15),
    Salary FLOAT,
    SectorId INT,
    FOREIGN KEY (SectorId) REFERENCES dbo.Sector(Id)
);

-- Bulk inserting data into the Employees table
-- These insertions add information about employees, their educational qualifications, salaries, and the sectors they belong to.
INSERT INTO dbo.Employee (Id, Name, Education, Salary, SectorId) VALUES
(101, 'Employee A', 'Masters', 50000, 1),
(102, 'Employee B', 'Bachelors', 45000, 2),
(103, 'Employee C', 'PhD', 55000, 3),
(104, 'Employee D', 'Masters', 48000, 4),
(105, 'Employee E', 'Bachelors', 47000, 5),
(106, 'Employee F', 'Masters', 52000, 1),
(107, 'Employee G', 'PhD', 53000, 7),
(108, 'Employee H', 'Bachelors', 46000, 8),
(109, 'Employee I', 'Masters', 51000, 9),
(110, 'Employee J', 'PhD', 54000, 9);

-- Creating the Projects table
-- This table stores information about projects. It has three columns:
-- 'Id' as the primary key, which is an integer representing the unique project ID.
-- 'Name' is a VARCHAR(50) column that stores the name of the project.
-- 'Balance' is a FLOAT column representing the budget balance allocated for the project.
CREATE TABLE dbo.Project (
    Id INT PRIMARY KEY,
    Name VARCHAR(50),
    Balance FLOAT
);

-- Bulk inserting data into the Projects table
-- These insertions add information about different projects and their budget balances.
INSERT INTO dbo.Project (Id, Name, Balance) VALUES
(1003, 'Project Gamma', 120000),
(1004, 'Project Delta', 180000),
(1005, 'Project Epsilon', 140000),
(1006, 'Project Zeta', 160000),
(1007, 'Project Eta', 110000),
(1008, 'Project Theta', 170000),
(1009, 'Project Iota', 130000),
(1010, 'Project Kappa', 150000);

-- Creating the WorksOn table
-- This table stores information about which employees work on which projects and in which role.
-- It has three columns:
-- 'EmployeeId' references the employee ID from the Employees table,
-- 'ProjectId' references the project ID from the Projects table, and
-- 'Role' is a VARCHAR(100) column that stores the role of the employee in that project.
-- The combination of 'EmployeeId' and 'ProjectId' is the primary key to ensure no duplicate records.
CREATE TABLE dbo.WorksOn (
    EmployeeId INT,
    ProjectId INT,
    Role VARCHAR(100),
    PRIMARY KEY (EmployeeId, ProjectId),
    FOREIGN KEY (EmployeeId) REFERENCES dbo.Employee(Id),
    FOREIGN KEY (ProjectId) REFERENCES dbo.Project(Id)
);

-- Bulk inserting data into the WorksOn table
-- These insertions specify which employees are working on which projects and their respective roles in each project.
INSERT INTO dbo.WorksOn (EmployeeId, ProjectId, Role) VALUES
(102, 1003, 'Analyst'),
(103, 1004, 'Developer'),
(104, 1005, 'Tester'),
(105, 1006, 'Manager'),
(106, 1007, 'Designer'),
(107, 1008, 'Architect'),
(107, 1009, 'Engineer'),
(107, 1010, 'Lead'),
(108, 1009, 'Engineer'),
(109, 1010, 'Consultant'),
(101, 1003, 'Support');

### **SQL Query 1**: Retrieve the names of departments and employees who are PhD and have a salary greater than 10,000, sorted by employee name.

- **Requirement**: Write an SQL query to get the names of departments and employees who are PhD and have a salary greater than 10,000, ordered by employee name.
- **Hint**: Use the `EMPLOYEES` table to filter for PhD employees with salary \> 10,000, and join with the `SECTORS` table to get department names.

In [19]:
/*
This query retrieves the names of employees and their respective sectors from the database. It filters the employees 
based on two conditions: 
1. Only employees with a 'PhD' education qualification are selected (WHERE e.Education = 'PhD').
2. The employee's salary must be greater than or equal to 54,000 (WHERE e.Salary >= 54000).

The query performs an inner join between the 'Employee' and 'Sector' tables on the 'SectorId' from the 'Employee' table 
and the 'Id' from the 'Sector' table. This ensures that for each employee selected, their corresponding sector is also included.

Finally, the results are ordered by the employee's name in ascending order (ORDER BY e.Name).
*/

SELECT e.Name, s.Name
FROM dbo.Employee e
INNER JOIN dbo.Sector s on e.SectorId = s.Id
WHERE e.Education='PhD' and e.Salary >= 54000
ORDER BY e.Name;

Name,Name
Employee C,Sector C
Employee J,Sector I


### **SQL Query 2**: Get the names of employees who are employed in Skopje.

- **Requirement**: Write an SQL query to get the names of employees who work in Skopje.
- **Hint**: Use the `EMPLOYEES` table and join with the `SECTORS` table to filter employees based on their sector's city.

In [20]:
/*
This query retrieves the names of employees from the 'Employee' table who are associated with sectors located in 'Skopje'.

The query works as follows:

1. The 'Employee' table is joined with the 'Sector' table based on the relationship between the 'SectorId' column in the 'Employee' table and the 'Id' column in the 'Sector' table. This is done using an INNER JOIN, which ensures that only employees with a matching sector are included.

2. The query filters the results to include only employees whose sector is located in 'Skopje' by checking the 'City' column in the 'Sector' table.

3. The result of the query is a list of employee names who work in sectors located in 'Skopje'.

*/

SELECT e.Name
FROM dbo.Employee e
INNER JOIN dbo.Sector s on e.SectorId = s.Id
WHERE s.City = 'Skopje';

Name
Employee A
Employee F

### **SQL Query 3**: Retrieve an overview of employee qualifications (education) for all departments (Sector) ordered by the sector's name.

- **Requirement**: Write an SQL query that provides an overview of employee qualifications grouped by department.

In [21]:
/*
This query retrieves a distinct list of sector names and corresponding employee education levels.

The query works as follows:

1. The 'Employee' table is joined with the 'Sector' table based on the relationship between the 'SectorId' column in the 'Employee' table and the 'Id' column in the 'Sector' table. This is done using an INNER JOIN, which ensures that only employees with a matching sector are included.

2. The 'SELECT DISTINCT' clause ensures that only unique combinations of sector names and employee education levels are included in the result set. This means if multiple employees in the same sector have the same education, that combination will appear only once.

3. The query retrieves the sector name from the 'Sector' table and the education level of employees from the 'Employee' table.

4. The result set is ordered by the sector name in ascending alphabetical order, based on the 'Name' column in the 'Sector' table.

*/

SELECT DISTINCT s.Name, e.Education
FROM dbo.Employee e
INNER JOIN dbo.Sector s on e.SectorId = s.Id
ORDER BY s.Name;

Name,Education
Sector A,Masters
Sector B,Bachelors
Sector C,PhD
Sector D,Masters
Sector E,Bachelors
Sector G,PhD
Sector H,Bachelors
Sector I,Masters
Sector I,PhD

### **SQL Query 4**: Get the names of employees who work in department 4 or 7.

- **Requirement**: Write an SQL query to retrieve the names of employees who work in department 4 or 7.
- **Hint**: Filter the `EMPLOYEES` table by `SectorId` for values 4 or 7, and select employee names.

In [22]:
/*
This query retrieves the names of employees who belong to specific sectors identified by their SectorId.

The query works as follows:

1. The 'Employee' table is used as the source of employee data, which is aliased as 'e'.

2. The 'WHERE' clause filters employees based on their 'SectorId'. It uses the 'IN' operator to check if the 'SectorId' of an employee is either 4 or 7.

3. The query only returns employees who work in sectors with the IDs 4 or 7. The 'IN' operator is a shorthand for multiple 'OR' conditions, making it easier to check for multiple values.

4. The result set consists of the 'Name' column from the 'Employee' table, meaning the names of employees who meet the specified sector criteria.

*/

SELECT e.Name
FROM dbo.Employee e
WHERE e.SectorId IN (4, 7);

Name
Employee D
Employee G

# SQL Set Operations: MINUS, UNION, and INTERSECT

In SQL, set operations are used to combine or subtract the result sets of two or more `SELECT` queries. These operations allow you to manipulate and compare data from different queries, but there are certain requirements for their use: the queries involved must return the same number of columns, and the corresponding columns must have compatible data types.

In this explanation, we'll cover three important set operations:

- **MINUS (SET DIFFERENCE)**: This is used to find records that exist in the first query's result set but not in the second query's result set. In SQL Server, the equivalent operation is called `EXCEPT`.
  
- **UNION (SET UNION)**: This is used to combine the results of two queries into a single result set, including all distinct rows from both queries.

- **INTERSECT (SET INTERSECTION)**: This is used to find records that are common to both result sets.

Each of these set operations requires that the two `SELECT` statements being compared must return the same number of columns with compatible data types.

---

## 1. MINUS (SET DIFFERENCE) / EXCEPT in SQL Server

### **Definition:**
The `MINUS` operation (also known as `EXCEPT` in SQL Server) returns all records from the first `SELECT` statement that do not appear in the second `SELECT` statement.

### **Usage Example:**

```sql
SELECT Name FROM Employees
MINUS
SELECT Name FROM RetiredEmployees;
```

This query retrieves the names of employees who are not retired. The result will exclude names from the Employees table that also appear in the RetiredEmployees table.

### **Key Points:**
The two queries involved must return the same number of columns with compatible data types.
 - `MINUS` removes all matching records from the first result set.
 - In SQL Server, `EXCEPT` is used instead of `MINUS`.


## 2. UNION (SET UNION)

### **Definition:**

The `UNION` operation is used to combine the results of two or more `SELECT` queries into a single result set, ensuring that each row appears only once. Duplicate rows are automatically eliminated.

### **Usage Example:**

```sql

SELECT Name FROM Employees
UNION
SELECT Name FROM RetiredEmployees;
```

This query retrieves the names of all employees, both active and retired, but without duplicates. If the same name appears in both the Employees and RetiredEmployees tables, it will only appear once in the final result set.

### **Key Points:**

 - The result set contains only distinct rows (no duplicates).
 - The columns returned by each query involved must have the same number and data type compatibility.
 - If you want to include duplicates in the result set, use `UNION ALL` instead of `UNION`.


 ## 3. INTERSECT (SET INTERSECTION)

### **Definition:**

The `INTERSECT` operation returns all records that are common to both result sets — that is, it retrieves only the rows that appear in both the first and second `SELECT` queries.


### **Usage Example:**

```sql
SELECT Name FROM Employees
INTERSECT
SELECT Name FROM RetiredEmployees;
```

This query retrieves the names of employees who are both in the Employees table and the RetiredEmployees table (i.e., those who are both active and retired).

### **Key Points:**
 - The result set contains only the rows that appear in both queries.
 - The number and data types of columns must be the same in both `SELECT` statements.
 - Similar to `UNION`, but instead of combining all rows, it only returns the common rows between the two queries.


 ## Summary of Differences

| **Operation**   | **Description**                                           | **Example Query**                                              | **SQL Server Equivalent**        |
|-----------------|-----------------------------------------------------------|---------------------------------------------------------------|----------------------------------|
| **MINUS**       | Returns rows from the first query that don't appear in the second query | `SELECT Name FROM Employees MINUS SELECT Name FROM RetiredEmployees` | `EXCEPT`                         |
| **UNION**       | Combines results of two queries, removing duplicates      | `SELECT Name FROM Employees UNION SELECT Name FROM RetiredEmployees` | Same (UNION is supported)        |
| **INTERSECT**   | Returns rows common to both queries                       | `SELECT Name FROM Employees INTERSECT SELECT Name FROM RetiredEmployees` | Same (INTERSECT is supported)    |

---

## Conclusion:

The `MINUS`, `UNION`, and `INTERSECT` operations are powerful tools for working with sets of data in SQL. Each operation allows you to:

- Find the difference between two sets (MINUS/EXCEPT)
- Combine two sets without duplicates (UNION)
- Get the intersection of two sets (INTERSECT)

Make sure that the columns and their data types align when using these operations, and remember that `MINUS` is known as `EXCEPT` in SQL Server.

### **SQL Query 5**: Find the IDs of the departments that do not have workers.

- **Requirement**: Write an SQL query that selects the ID of departments (SECTORS) that do not have any employees.

In [23]:
/*
Explanation of the Query:

This query consists of two parts:

1. **First Query**: 
   (SELECT Id FROM dbo.Sector EXCEPT SELECT SectorId FROM dbo.Employee)
   - This part retrieves the list of `Id` values from the `dbo.Sector` table that do not have a matching `SectorId` in the `dbo.Employee` table.
   - The `EXCEPT` operator is used here, which returns rows from the first query (sectors) that do not exist in the second query (employees' sector IDs). Essentially, this identifies sectors that do not have any employees assigned to them.

2. **Second Query**:
   SELECT * FROM dbo.Employee
   - This part retrieves all rows and columns from the `dbo.Employee` table. It will display a list of all employees with their details.

In summary, the first query finds sectors with no employees, and the second query displays all employee information.

*/

(SELECT Id
FROM dbo.Sector 
EXCEPT
SELECT SectorId
FROM dbo.Employee)

GO

SELECT *
FROM dbo.Employee

Id
6
10

Id,Name,Education,Salary,SectorId
101,Employee A,Masters,50000,1
102,Employee B,Bachelors,45000,2
103,Employee C,PhD,55000,3
104,Employee D,Masters,48000,4
105,Employee E,Bachelors,47000,5
106,Employee F,Masters,52000,1
107,Employee G,PhD,53000,7
108,Employee H,Bachelors,46000,8
109,Employee I,Masters,51000,9
110,Employee J,PhD,54000,9

### **SQL Query 6**: Select the IDs of Bachelors employees who participate in some projects (work on at least one project).

- **Requirement**: Write an SQL query to get the IDs of Bachelors employees working on projects.
- **Hint**: Use the `WORKS_ON` table to find employees working on projects and filter for bachelor employees from the `EMPLOYEES` table.

In [26]:
/*
Explanation of the Query:

This query consists of two parts combined by the `INTERSECT` operator:

1. **First Query**: 
   SELECT EmployeeId FROM dbo.WorksOn
   - This part retrieves a list of `EmployeeId` values from the `dbo.WorksOn` table, which indicates employees who are working on specific projects.
   
2. **Second Query**:
   SELECT Id FROM dbo.Employee WHERE Education='Bachelors'
   - This part retrieves the `Id` values from the `dbo.Employee` table where the employee has a Bachelor's degree.

3. **INTERSECT**:
   - The `INTERSECT` operator is used to find the common rows between the two queries.
   - It returns the `EmployeeId` values that appear in both the `dbo.WorksOn` table (employees working on projects) and the `dbo.Employee` table (employees with a Bachelor's degree).
   - Essentially, this query identifies employees who are working on projects and have a Bachelor's degree.

In summary, this query retrieves the list of employees who are both working on projects and have a Bachelor's degree.

*/


(SELECT EmployeeId
FROM dbo.WorksOn

INTERSECT

SELECT Id
FROM dbo.Employee
WHERE Education='Bachelors');


GO

SELECT * FROM dbo.Employee;

EmployeeId
102
105
108

Id,Name,Education,Salary,SectorId
101,Employee A,Masters,50000,1
102,Employee B,Bachelors,45000,2
103,Employee C,PhD,55000,3
104,Employee D,Masters,48000,4
105,Employee E,Bachelors,47000,5
106,Employee F,Masters,52000,1
107,Employee G,PhD,53000,7
108,Employee H,Bachelors,46000,8
109,Employee I,Masters,51000,9
110,Employee J,PhD,54000,9

# Aggregate Functions in SQL

Aggregate functions are essential in SQL for performing calculations on a set of rows and returning a single result. These functions operate on a set of values and return a single value that summarizes the data. Here’s a detailed explanation of the most commonly used aggregate functions:

## 1. **AVG()** – Average
The `AVG()` function calculates the average value of the argument (a column or expression). It returns the arithmetic mean of all the values in the specified column, excluding any `NULL` values. 

### Example Usage:
```sql
SELECT AVG(Salary) FROM Employees;
```

This query calculates the average salary of all employees in the `Employees` table.


### Explanation:

 - The `AVG()` function adds up all the values in the `Salary` column and divides the result by the number of values (excluding `NULL` values) to return the average salary of employees.

 # Aggregate Functions in SQL

Aggregate functions are essential in SQL for performing calculations on a set of rows and returning a single result. These functions operate on a set of values and return a single value that summarizes the data. Here’s a detailed explanation of the most commonly used aggregate functions:

## 1. **AVG()** – Average
The `AVG()` function calculates the average value of the argument (a column or expression). It returns the arithmetic mean of all the values in the specified column, excluding any `NULL` values. 

### Example Usage:
```sql
SELECT AVG(Salary) FROM Employees;
```

This query retrieves the highest salary in the `Employees` table.

### Explanation:

 - The `MAX()` function compares all the values in the `Salary` column and returns the largest value.

 ## 3. **MIN()** – Minimum
The `MIN()` function returns the smallest value from a set of values in the specified column or expression. It is used to identify the minimum value, such as the lowest salary or the earliest order date.

### Example Usage:
```sql
SELECT MIN(Salary) FROM Employees;
```

This query retrieves the lowest salary in the `Employees` table.

### Explanation:

 - The `MIN()` function compares all the values in the Salary column and returns the smallest value.

 ## 4. **SUM()** – Total Sum
The `SUM()` function calculates the total sum of all the values in the specified column or expression. It adds together all the non-NULL values to return the total.

### Example Usage:
```sql
SELECT SUM(Salary) FROM Employees;
```

This query calculates the total salary paid to all employees in the `Employees` table.

### Explanation:
 - The `SUM()` function adds all the values in the Salary column, returning the total sum of salaries across all employees.


 ## 5. **COUNT()** – Count of Non-NULL Values
The `COUNT()` function returns the number of non-NULL values in a specified column or expression. It is useful for counting rows or records that contain data in the selected column.

### Example Usage:
```sql
SELECT COUNT(EmployeeId) FROM Employees;
```

This query returns the number of employees in the `Employees` table.

### Explanation:

 - The `COUNT()` function counts how many non-NULL values exist in the EmployeeId column, which gives the total number of employees in the table.

## Conclusion
Aggregate functions such as `AVG()`, `MAX()`, `MIN()`, `SUM()`, and `COUNT()` are powerful tools for summarizing and analyzing data in SQL. These functions allow you to calculate statistical values, total sums, counts, and more across large datasets, making them invaluable for data analysis and reporting tasks.

### **SQL Query 7**: Calculate the average income of Mesters workers.

- **Requirement**: Write an SQL query to calculate the average salary of Masters employees.
- **Hint**: Use the `EMPLOYEES` table to filter for Masters employees, then calculate the average of their salary.

In [27]:
SELECT AVG(Salary) as avg_salary, MAX(Salary) as max_salary
FROM dbo.Employee
WHERE Education='Masters';

avg_salary,max_salary
50250,52000

### **SQL Query 8**: Count the number of different roles performed in projects by the employee no. 107.

- **Requirement**: Write an SQL query to find the number of distinct roles (functions) employee no. 107 performs in projects.
- **Hint**: Use the `WORKS_ON` table to filter by `EmployeeId = 107` and count distinct `Role` values.

In [28]:
SELECT COUNT(DISTINCT [Role]) -- COUNT in relational algebra
FROM dbo.WorksOn
WHERE EmployeeId = 107;

(No column name)
3

# Problem 3

# Product Table Overview

The `PRODUCT` table is a crucial component of our database schema, designed to store information about the products available for purchase and sale. Below is a description of its structure and purpose:

## Table: PRODUCT

| **Column Name**    | **Data Type** | **Description**                                                                 |
|---------------------|---------------|---------------------------------------------------------------------------------|
| `code`             | `VARCHAR`     | A unique identifier for each product.                                          |
| `name`             | `VARCHAR`     | The name or description of the product.                                        |
| `metric`           | `VARCHAR`     | The unit of measurement (e.g., kilograms, liters, pieces).                     |
| `amount`           | `INTEGER`     | The quantity of the product in stock.                                          |
| `purchasePrice`    | `DECIMAL`     | The price at which the product was purchased.                                  |
| `salePrice`        | `DECIMAL`     | The price at which the product is sold to customers.                           |

## Key Features

- **Code Uniqueness:** The `code` column serves as a primary key, ensuring that each product is uniquely identifiable.
- **Pricing Information:** The table includes both the `purchasePrice` and `salePrice` to track profit margins.
- **Stock Tracking:** The `amount` column helps monitor inventory levels.

## Example Data

Here is an example of how the data might look in the `PRODUCT` table:

![product_table](product_table.png)

In [ ]:
/*
    This script checks if a database named 'db_dml_first_problem' exists:
    - If the database does NOT exist, it creates a new empty database.
    - If the database DOES exist, it deletes all tables within the database by:
        1. Dropping all foreign key constraints to handle dependencies.
        2. Dropping all tables to make the database empty.
*/

-- Check if the database exists
IF (SELECT COUNT(*) FROM sys.databases WHERE name = 'db_dml_third_problem') = 0
BEGIN
    -- Create the database if it doesn't exist
    CREATE DATABASE db_dml_third_problem;
    PRINT 'Database created: db_dml_third_problem';
END
ELSE
BEGIN
    PRINT 'Database already exists: db_dml_third_problem';
END

GO
-- Use the database
USE db_dml_third_problem;

-- Step 1: Drop all foreign key constraints if any exist
IF EXISTS (SELECT * FROM sys.foreign_keys)
BEGIN
    DECLARE @sql NVARCHAR(MAX);
    SET @sql = '';

    SELECT @sql = @sql + 'ALTER TABLE [' + OBJECT_NAME(parent_object_id) 
                 + '] DROP CONSTRAINT [' + name + '];' + CHAR(13)
    FROM sys.foreign_keys;

    EXEC sp_executesql @sql;
    PRINT 'Foreign keys dropped';
END
ELSE
BEGIN
    PRINT 'No foreign keys to drop';
END

-- Step 2: Drop all tables if any exist
IF EXISTS (SELECT * FROM sys.tables)
BEGIN
    SET @sql = '';

    SELECT @sql = @sql + 'DROP TABLE [' + name + '];' + CHAR(13)
    FROM sys.tables;

    EXEC sp_executesql @sql;
    PRINT 'Tables dropped';
END
ELSE
BEGIN
    PRINT 'No tables to drop';
END

In [ ]:
USE db_dml_third_problem;

# Creating and Populating Tables

The following cell in this notebook contains the DDL expressions required to create the necessary tables based on the provided ER diagram and relations. Additionally, it includes `INSERT` statements to populate these tables with sample data. 

By executing the DDL and DML statements, you will have a fully prepared database schema and data, enabling you to write and execute SQL queries to solve the tasks outlined in the exercise.

In [ ]:
-- Create the table with dbo schema and renamed to "Product"
CREATE TABLE dbo.Product (
    product_id INT PRIMARY KEY IDENTITY(1,1),
    code VARCHAR(10) UNIQUE NOT NULL,
    name VARCHAR(255),
    metric VARCHAR(50),
    amount INT,
    purchasePrice FLOAT,
    salePrice FLOAT
);

-- Bulk insert the data into dbo.Product
INSERT INTO dbo.Product (code, name, metric, amount, purchasePrice, salePrice)
VALUES
    ('L12', 'Bread T-400', 'piece', 120, 20.00, 20.00),
    ('M3', 'Sunflower oil', 'lit', 89, 65.01, 72.00),
    ('M8', 'Olive oil', 'lit', 34, 209.35, 250.00),
    ('K14', 'Tomatoes', 'kg', 345, 56.00, 60.00),
    ('M16', 'Cholesterol-free oil', 'lit', 99, 70.50, 75.00),
    ('L3', 'Bakery bread', 'piece', 206, 25.00, 25.00),
    ('K22', 'Peppers', 'kg', 870, 48.89, 50.00),
    ('K30', 'Strawberries', 'kg', 200, 100.50, 120.00),
    ('L2', 'Flatbread', 'piece', 189, 23.00, 23.00);

### **SQL Query 1**: List the names of the products along with the purchase price and the selling price excluding VAT (value-added tax).

- **Requirement**: Write an SQL query to retrieve the names of products, their purchase price, and selling price, excluding VAT.
- **Hint**: Calculate the selling price without VAT by applying the formula `salePrice * 0.8` (assuming VAT is 20%).

In [ ]:
SELECT [name], purchasePrice, salePrice * 0.8 AS vat_free_sale_price
FROM dbo.Product;


### **SQL Query 2**: List the names of the products along with the purchase and selling price, as well as the difference between the selling and purchase price.

- **Requirement**: Write an SQL query to display the product names, their purchase price, selling price, and the difference between the selling and purchase price.
- **Hint**: Use a computed column for the difference: `salePrice - purchasePrice`.

In [ ]:
SELECT [name], purchasePrice, salePrice, ABS(salePrice - purchasePrice) AS difference
FROM dbo.Product;

## SQL `LIKE` Keyword

The `LIKE` keyword in SQL is used to search for a specified pattern in a column. It allows you to match data that follows a specific pattern using wildcard characters.

### Syntax

```sql
SELECT column_name(s)
FROM table_name
WHERE column_name LIKE pattern;
```

## Wildcard Characters

- **%**: Represents zero or more characters.
- **_**: Represents a single character.

## Examples

### Using `%` (zero or more characters):

```sql
SELECT * FROM customers
WHERE name LIKE 'J%';
```

This query retrieves all customers whose name starts with "J".

### Using `_` (a single character):

```sql
SELECT * FROM customers
WHERE name LIKE '_a%';
```

This query retrieves all customers whose name has "a" as the second character.

### Combining both wildcards:

```sql

SELECT * FROM customers
WHERE name LIKE 'J_o%';
```


This query retrieves all customers whose name starts with "J", has "o" as the second character, and can have any characters after that.

## Case Sensitivity

The `LIKE` keyword may be case-insensitive depending on the database system. For example, in MySQL, `LIKE` is case-insensitive by default, while in PostgreSQL, it is case-sensitive.

## Notes

- `LIKE` is typically used for pattern matching with string values.
- It is slower than `=` when used on large datasets because it requires checking each value against the pattern.
- You can combine `LIKE` with other conditions, such as `AND`, `OR`, and `NOT`.

### **SQL Query 3**: List the data for the products whose names begin with "oil"

- **Requirement**: Write an SQL query to retrieve all columns for products whose names start with "oil"
- **Hint**: Use a `LIKE` clause with a wildcard, such as `name LIKE 'oil%'`.

In [ ]:
SELECT *
FROM dbo.Product
WHERE [name] LIKE '%oil';

## SQL `IN` Keyword

The `IN` keyword in SQL is used to specify multiple possible values for a column in a `WHERE` clause. It allows you to filter the results based on a list of values, making the query more readable and concise compared to using multiple `OR` conditions.

### Syntax

```sql
SELECT column_name(s)
FROM table_name
WHERE column_name IN (value1, value2, ..., valueN);
```

## Description

- **column_name**: The name of the column you want to filter.
- **value1, value2, ..., valueN**: A list of values that you want to compare against the column.

The `IN` keyword is a shorthand for multiple `OR` conditions. For example, the following query:

```sql
SELECT * FROM employees
WHERE department = 'HR' OR department = 'Finance' OR department = 'Marketing';
```

is equivalent to:

```sql
SELECT * FROM employees
WHERE department IN ('HR', 'Finance', 'Marketing');
```

This query retrieves all employees who belong to departments located in New York.

## Notes

- The `IN` keyword works with numeric, string, and date values.
- It can be combined with other conditions such as `AND` or `OR`.
- `IN` can also be used with subqueries to filter results dynamically based on another set of data.

### **SQL Query 4**: List the products measured in liters and kilograms.

- **Requirement**: Write an SQL query to retrieve all columns for products with `metric` values of either "lit" or "kg."
- **Hint**: Use the `IN` operator to filter the `metric` column: `metric IN ('lit', 'kg')`.

In [ ]:
SELECT *
FROM dbo.Product
WHERE metric IN ('lit', 'kg'); -- metric='lit' OR metric='kg'

## SQL `BETWEEN` Keyword

The `BETWEEN` keyword in SQL is used to filter the results within a range of values. It can be applied to numeric, date, or text data types to match values that fall within a specified range.

### Syntax

```sql
SELECT column_name(s)
FROM table_name
WHERE column_name BETWEEN value1 AND value2;
```

## Description

- **column_name**: The name of the column to filter.
- **value1 and value2**: The start and end values of the range. The range is inclusive, meaning the values `value1` and `value2` will be included in the result set.

## Example 1: Numeric Range

```sql
SELECT * FROM products
WHERE price BETWEEN 100 AND 500;
```

This query retrieves all products with prices between 100 and 500, inclusive.

## Example 2: Date Range

```sql

SELECT * FROM orders
WHERE order_date BETWEEN '2024-01-01' AND '2024-12-31';

```

This query retrieves all orders placed between January 1, 2024, and December 31, 2024, inclusive.

## Example 3: Text Range

```sql
SELECT * FROM employees
WHERE name BETWEEN 'John' AND 'Mike';

```

This query retrieves all employees whose names fall alphabetically between "John" and "Mike", inclusive.

## Notes

- The `BETWEEN` keyword is inclusive of both the lower and upper bounds.
- It can be combined with other conditions such as `AND` or `OR`.
- The range can be defined using numeric, date, or text values.
- The `BETWEEN` keyword is often used for filtering ranges of values efficiently, but it may not work as expected with non-contiguous data.


### **SQL Query 5**: List the products that have a selling price between 50.00 and 250.00 denars.

- **Requirement**: Write an SQL query to retrieve all columns for products where the `salePrice` is within the range 50.00 and 250.00.
- **Hint**: Use a `BETWEEN` clause: `salePrice BETWEEN 50.00 AND 250.00`.

In [ ]:
SELECT *
FROM dbo.Product
-- WHERE purchasePrice >= 50 AND purchasePrice <=250
WHERE purchasePrice BETWEEN 50 AND 250

# PROBLEM 4

# PART and ORDERS Tables Overview

In this example, we have two tables, **PART** and **ORDERS**, each representing a different aspect of a business process.

---

## **PART Table**
The **PART** table contains information about the parts or items available for ordering. Below are the columns in this table:

| **Column Name**  | **Description**                                                                 |
|-------------------|---------------------------------------------------------------------------------|
| `PartNumber`      | A unique identifier for each part.                                              |
| `Description`     | A brief text description of the part.                                           |
| `Price`           | The price per unit of the part.                                                 |



---

## **ORDERS Table**
The **ORDERS** table stores details about the orders placed by customers. It references the **PART** table via the `PartNumber` column, linking each order to a specific part.

| **Column Name**  | **Description**                                                                 |
|-------------------|---------------------------------------------------------------------------------|
| `OrderedOn`       | The date and time the order was placed.                                         |
| `Name`            | The name of the customer placing the order.                                    |
| `PartNumber`      | The identifier of the part being ordered (foreign key linking to the PART table).|
| `Quantity`        | The number of units of the part being ordered.                                 |
| `Remarks`         | Additional notes or remarks about the order.                                   |


![order_part_tables](order_part_tables.png)

In [ ]:
/*
    This script checks if a database named 'db_dml_first_problem' exists:
    - If the database does NOT exist, it creates a new empty database.
    - If the database DOES exist, it deletes all tables within the database by:
        1. Dropping all foreign key constraints to handle dependencies.
        2. Dropping all tables to make the database empty.
*/

-- Check if the database exists
IF (SELECT COUNT(*) FROM sys.databases WHERE name = 'db_dml_fourth_problem') = 0
BEGIN
    -- Create the database if it doesn't exist
    CREATE DATABASE db_dml_fourth_problem;
    PRINT 'Database created: db_dml_fourth_problem';
END
ELSE
BEGIN
    PRINT 'Database already exists: db_dml_fourth_problem';
END

GO
-- Use the database
USE db_dml_fourth_problem;

-- Step 1: Drop all foreign key constraints if any exist
IF EXISTS (SELECT * FROM sys.foreign_keys)
BEGIN
    DECLARE @sql NVARCHAR(MAX);
    SET @sql = '';

    SELECT @sql = @sql + 'ALTER TABLE [' + OBJECT_NAME(parent_object_id) 
                 + '] DROP CONSTRAINT [' + name + '];' + CHAR(13)
    FROM sys.foreign_keys;

    EXEC sp_executesql @sql;
    PRINT 'Foreign keys dropped';
END
ELSE
BEGIN
    PRINT 'No foreign keys to drop';
END

-- Step 2: Drop all tables if any exist
IF EXISTS (SELECT * FROM sys.tables)
BEGIN
    SET @sql = '';

    SELECT @sql = @sql + 'DROP TABLE [' + name + '];' + CHAR(13)
    FROM sys.tables;

    EXEC sp_executesql @sql;
    PRINT 'Tables dropped';
END
ELSE
BEGIN
    PRINT 'No tables to drop';
END

In [ ]:
USE db_dml_fourth_problem;

# Creating and Populating Tables

The following cell in this notebook contains the DDL expressions required to create the necessary tables based on the provided ER diagram and relations. Additionally, it includes `INSERT` statements to populate these tables with sample data. 

By executing the DDL and DML statements, you will have a fully prepared database schema and data, enabling you to write and execute SQL queries to solve the tasks outlined in the exercise.

In [ ]:
-- Create the Part table
CREATE TABLE dbo.Part (
    PartNumber INT PRIMARY KEY,
    Description VARCHAR(255),
    Price DECIMAL(10, 2)
);

-- Bulk insert data into Part table
INSERT INTO dbo.Part (PartNumber, Description, Price)
VALUES
(54, 'PEDALS', 54.25),
(42, 'SEATS', 24.50),
(46, 'TIRES', 15.25),
(23, 'MOUNTAIN BIKE', 350.45),
(76, 'ROAD BIKE', 530.00),
(10, 'TANDEM', 1200.00);

-- Create the Order table
CREATE TABLE dbo.[Order] (
    OrderedOn DATE,
    Name VARCHAR(255),
    PartNumber INT,
    Quantity INT,
    Remarks VARCHAR(10),
    FOREIGN KEY (PartNumber) REFERENCES dbo.Part(PartNumber)
);

-- Bulk insert data into Order table
INSERT INTO dbo.[Order] (OrderedOn, Name, PartNumber, Quantity, Remarks)
VALUES
('1996-05-15', 'TRUE WHEEL', 23, 6, 'PAID'),
('1996-05-19', 'TRUE WHEEL', 76, 3, 'PAID'),
('1996-09-02', 'TRUE WHEEL', 10, 1, 'PAID'),
('1996-06-30', 'TRUE WHEEL', 42, 8, 'PAID'),
('1996-06-30', 'BIKE SPEC', 54, 10, 'PAID'),
('1996-05-30', 'BIKE SPEC', 10, 2, 'PAID'),
('1996-05-30', 'BIKE SPEC', 23, 8, 'PAID'),
('1996-01-17', 'BIKE SPEC', 76, 11, 'PAID'),
('1996-01-17', 'LE SHOPPE', 76, 5, 'PAID'),
('1996-06-01', 'LE SHOPPE', 10, 3, 'PAID'),
('1996-06-01', 'AAA BIKE', 10, 1, 'PAID'),
('1996-07-01', 'AAA BIKE', 76, 4, 'PAID'),
('1996-07-01', 'AAA BIKE', 46, 1, 'PAID'),
('1996-07-11', 'JACKS BIKE', 76, 14, 'PAID');

### **SQL Query 1**: List the orders in which products starting with ROAD were sold.

- **Requirement**: Write an SQL query to list the orders in which products starting with "ROAD" were sold.
- **Hint**: Use the `PRODUCTS` table to filter for products whose names start with "ROAD" and join with the `ORDERS` table to retrieve order details.

In [ ]:
SELECT o.*
FROM dbo.Part p
INNER JOIN dbo.[Order] o ON p.PartNumber=o.PartNumber
WHERE p.Description LIKE 'ROAD%';

### **SQL Query 2**: Find the average price of the orders.

- **Requirement**: Write an SQL query to calculate the average price of all orders.
- **Hint**: Use the `ORDERS` table to compute the average price by summing up the total order value and dividing by the number of orders.

In [ ]:
SELECT AVG(o.Quantity * Price) as avg_value
FROM dbo.[Order] o 
INNER JOIN dbo.Part p ON o.PartNumber=p.PartNumber;

 -- value = quantity * price

### **SQL Query 3**: List the orders' names and dates with a value greater than the average price of all orders.

- **Requirement**: Write an SQL query to retrieve the names and the dates of the orders where the order value is greater than the average price of all orders.

In [ ]:
SELECT *, o.QUANTITY * p.Price AS [value]
FROM dbo.[Order] o 
INNER JOIN dbo.Part p ON o.PartNumber=p.PartNumber
WHERE o.Quantity * p.Price >= (
                                SELECT AVG(o.Quantity * Price) AS avg_value
                                FROM dbo.[Order] o 
                                INNER JOIN dbo.Part p ON o.PartNumber=p.PartNumber
                                )

### **SQL Query 4**: Provide an overview of the average ordered quantity per orderer (name in Order).

- **Requirement**: Write an SQL query to calculate the average ordered quantity per orderer (name in Order table).

In [ ]:
SELECT [Name], AVG(Quantity) as avg_quantity
FROM dbo.[Order] 
GROUP BY [Name];

## SQL `HAVING` Keyword

The `HAVING` keyword in SQL is used to filter records after an aggregation has been performed. It is typically used with the `GROUP BY` clause to apply conditions to groups of rows. While the `WHERE` clause is used to filter rows before any grouping, the `HAVING` clause filters groups after the aggregation is applied.

### Syntax

```sql
SELECT column_name(s), aggregate_function(column_name)
FROM table_name
WHERE condition
GROUP BY column_name
HAVING condition;
```

## Description

- **column_name(s)**: The name(s) of the column(s) to be selected.
- **aggregate_function**: The aggregate function (e.g., `COUNT()`, `SUM()`, `AVG()`, `MAX()`, `MIN()`) used to summarize the data.
- **condition**: The condition that must be met after grouping and aggregation.

## Example 1: Using `HAVING` with `COUNT()`

```sql
SELECT department, COUNT(employee_id)
FROM employees
GROUP BY department
HAVING COUNT(employee_id) > 10;
```

This query retrieves all departments where the number of employees is greater than 10.

## Example 2: Using `HAVING` with `SUM()`

```sql

SELECT region, SUM(sales)
FROM sales
GROUP BY region
HAVING SUM(sales) > 100000;

```

This query retrieves regions where the total sales exceed 100,000.

## Notes

- The `HAVING` clause is used after `GROUP BY` and applies the condition to the aggregated results.
- It is often used in combination with aggregate functions like `COUNT()`, `SUM()`, `AVG()`, etc.
- You cannot use `HAVING` without a `GROUP BY` clause, although you can use it without an aggregate function if grouping is still required.
- Unlike `WHERE`, which filters individual rows, `HAVING` filters groups of rows after they have been aggregated.

### **SQL Query 5**: List the codes of all products along with the total amount realized from the orders for that product, as well as the number of orders for that product. In addition, discard all product codes for which the total amount is less than or equal to the average sales realized for that product.

- **Requirement**: Write an SQL query to list the product codes along with the total revenue and the number of orders for each product. Exclude products for which the total amount is less than or equal to the average sales realized.
- **Hint**: Use the `ORDER_ITEMS` table to calculate the total amount and number of orders for each product. Then, compare the total amount with the average sales realized to filter the results.

In [ ]:
SELECT p.PartNumber, SUM(o.Quantity * p.Price) AS part_value, COUNT(*) AS no_parts, AVG(o.Quantity * p.Price) AS avg_value
FROM dbo.[Order] o 
INNER JOIN dbo.Part p ON o.PartNumber = p.PartNumber
GROUP BY p.PartNumber
HAVING SUM(o.Quantity * p.Price) > AVG(o.Quantity * p.Price);

In the SQL standard we have the EXIST function and the ALL and ANY keywords which can be used in the WHERE clause of an SQL statement.

- **EXISTS** is followed by a subquery as an argument and returns TRUE if the subquery returns at least one tuple, otherwise (if the result of the subquery is an empty set) it returns FALSE. 
    
- **ANY** is used after a relational operator (\<, \>, \>=, \<=, =) preceded with an attribute, and is followed by a set of values (either explicit set or a subquery) and it returns TRUE if the relational operation is TRUE for at least one combination of the attribute preceding the operator and a value from the set following the ANY keyword.
    
- **ALL** is used in the same way as ANY and it returns TRUE if the relational operation is TRUE for all combinations of the attribute preceding the operator and values from the set following the ALL keyword.

### **SQL Query 6**: List orders for parts that have a price greater than 1000.

- **Requirement**: Write an SQL query to place orders for parts that have a price greater than 1000.
- **Hint**: Use the `PARTS` table to filter for parts with a price greater than 1000 and then insert those parts into the `ORDERS` table.

* * *

In [ ]:
SELECT *
FROM dbo.[Order] o 
WHERE EXISTS (
    SELECT *
    FROM dbo.Part p 
    WHERE o.PartNumber=p.PartNumber AND p.price > 1000
 );

### **SQL Query 7**: Find the order with the largest quantity (without using MAX).

- **Requirement**: Write an SQL query to find the order with the largest quantity, without using the `MAX` function.
- **Hint**: You can achieve this by ordering the `ORDERS` table in descending order by quantity and then using `LIMIT 1` to get the first row.

In [ ]:
SELECT *
FROM dbo.[Order]
WHERE Quantity >= ALL  (
                        SELECT Quantity
                        FROM dbo.[Order]
                        );

### **SQL Query 8**: Find the parts ordered in the same quantity as another part.

- **Requirement**: Write an SQL query to find parts that were ordered in the same quantity as another part.
- **Hint**: Use a self-join on the `ORDER_ITEMS` table to compare the quantities of different parts in the same order.

In [ ]:
SELECT *
FROM dbo.[Order] o1
WHERE Quantity = ANY (
                    SELECT Quantity
                    FROM dbp.[Order] o2
                    WHERE o1.PartNumber <> o2.PartNumber
                    )
ORDER BY Quantity, PartNumber;